zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MRAMC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MRAMC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MRAMC_H_)  /* Check if memory map has not been already included */
#define S32K566_MRAMC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MRAMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRAMC_Peripheral_Access_Layer MRAMC Peripheral Access Layer
 * @{
 */

/** MRAMC - Size of Registers Arrays */
#define MRAMC_PCI_COUNT                           3u
#define MRAMC_PLPLOCKN_COUNT                      1u
#define MRAMC_LLOCKOWNERN_COUNT                   8u
#define MRAMC_LOCKOWNERN_COUNT                    3u
#define MRAMC_WRL_WDATAL_PAGEI_WORD_COUNT         8u
#define MRAMC_WRL_WDATAL_PAGEI_WORD_WDATAL_PAGEI_WORDJ_COUNT 8u
#define MRAMC_WRL_WSTRBL_PAGEI_COUNT              8u
#define MRAMC_WRL_COUNT                           2u

/** MRAMC - Register Layout Typedef */
typedef struct MRAMC_Struct {
  uint8_t RESERVED_0[4];
  __IO uint32_t PC[MRAMC_PCI_COUNT];               /**< Port Configuration, array offset: 0x4, array step: 0x4 */
  uint8_t RESERVED_1[128];
  __IO uint32_t P1_RIA_W0;                         /**< Port i Read ID Assignment Word j, offset: 0x90 */
  __IO uint32_t P1_RIA_W1;                         /**< Port i Read ID Assignment Word j, offset: 0x94 */
  uint8_t RESERVED_2[8];
  __IO uint32_t P2_RIA_W0;                         /**< Port i Read ID Assignment Word j, offset: 0xA0 */
  __IO uint32_t P2_RIA_W1;                         /**< Port i Read ID Assignment Word j, offset: 0xA4 */
  uint8_t RESERVED_3[8];
  __IO uint32_t P3_RIA_W0;                         /**< Port i Read ID Assignment Word j, offset: 0xB0 */
  uint8_t RESERVED_4[76];
  __IO uint32_t LPLOCK;                            /**< Large Partition Lock, offset: 0x100 */
  uint8_t RESERVED_5[12];
  __IO uint32_t SPLOCK;                            /**< Small Partition Lock, offset: 0x110 */
  uint8_t RESERVED_6[4];
  __IO uint32_t LPOLOCK;                           /**< Large Partition OTP Lock, offset: 0x118 */
  __IO uint32_t UTLOCK;                            /**< UTest Lock, offset: 0x11C */
  uint8_t RESERVED_7[16];
  __IO uint32_t PLPLOCK[MRAMC_PLPLOCKN_COUNT];     /**< Protect Large Partition Lock, array offset: 0x130, array step: 0x4 */
  uint8_t RESERVED_8[12];
  __IO uint32_t PSPLOCK;                           /**< Protect Small Partition Lock, offset: 0x140 */
  uint8_t RESERVED_9[4];
  __IO uint32_t PLPOLOCK;                          /**< Protect Large Partition OTP Lock, offset: 0x148 */
  __IO uint32_t PUTLOCK;                           /**< Protect UTest Lock, offset: 0x14C */
  uint8_t RESERVED_10[176];
  __I  uint32_t LPLOCKOW[MRAMC_LLOCKOWNERN_COUNT]; /**< Large Partition Lock Owner, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_11[224];
  __I  uint32_t LOCKOW[MRAMC_LOCKOWNERN_COUNT];    /**< Small partition Lock Owner..UTest Lock Owner, array offset: 0x300, array step: 0x4 */
  uint8_t RESERVED_12[116];
  __IO uint32_t ERRINJCTL;                         /**< Error Injection Control, offset: 0x380 */
  uint8_t RESERVED_13[4];
  __IO uint32_t ERRSTAT0;                          /**< Error Status 0, offset: 0x388 */
  __I  uint32_t ERRSTAT1;                          /**< Error Status 1, offset: 0x38C */
  uint8_t RESERVED_14[16];
  __IO uint32_t ERRNTCTL0;                         /**< Error Notification Control 0, offset: 0x3A0 */
  uint8_t RESERVED_15[88];
  __IO uint32_t WWDOG;                             /**< Write Watchdog, offset: 0x3FC */
  struct MRAMC_WRL {                               /* offset: 0x400, array step: 0x200 */
    __IO uint32_t WDATA_PAGE_WORD[MRAMC_WRL_WDATAL_PAGEI_WORD_COUNT][MRAMC_WRL_WDATAL_PAGEI_WORD_WDATAL_PAGEI_WORDJ_COUNT];   /**< Write Data, array offset: 0x400, array step: index*0x200, index2*0x20, index3*0x4 */
    __IO uint32_t WSTRB_PAGE[MRAMC_WRL_WSTRBL_PAGEI_COUNT];   /**< Write Strobe, array offset: 0x500, array step: index*0x200, index2*0x4 */
    __IO uint32_t WADDR;                             /**< Write Address, array offset: 0x520, array step: 0x200 */
    __IO uint32_t WCTL;                              /**< Write Control, array offset: 0x524, array step: 0x200 */
    __IO uint32_t WSTAT;                             /**< Write Status, array offset: 0x528, array step: 0x200 */
    uint8_t RESERVED_0[212];
  } WRL[MRAMC_WRL_COUNT];
  uint8_t RESERVED_16[2032];
       uint32_t DBGSTAT0;                          /**< Debug Status 0, offset: 0xFF0 */
       uint32_t DBGSTAT1;                          /**< Debug Status 1, offset: 0xFF4 */
       uint32_t DBGSTAT2;                          /**< Debug Status 2, offset: 0xFF8 */
       uint32_t DBGSTAT3;                          /**< Debug Status 3, offset: 0xFFC */
} MRAMC_Type, *MRAMC_MemMapPtr;

/** Number of instances of the MRAMC module. */
#define MRAMC_INSTANCE_COUNT                     (1u)

