zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
/* MRAMC - Peripheral instance base addresses */
/** Peripheral MRAMC base address */
#define IP_MRAMC_BASE                            (0x4049C000u)
/** Peripheral MRAMC base pointer */
#define IP_MRAMC                                 ((MRAMC_Type *)IP_MRAMC_BASE)
/** Array initializer of MRAMC peripheral base addresses */
#define IP_MRAMC_BASE_ADDRS                      { IP_MRAMC_BASE }
/** Array initializer of MRAMC peripheral base pointers */
#define IP_MRAMC_BASE_PTRS                       { IP_MRAMC }

/* ----------------------------------------------------------------------------
   -- MRAMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRAMC_Register_Masks MRAMC Register Masks
 * @{
 */

/*! @name PC - Port Configuration */
/*! @{ */

#define MRAMC_PC_RCBFEN_MASK                     (0x1U)
#define MRAMC_PC_RCBFEN_SHIFT                    (0U)
#define MRAMC_PC_RCBFEN_WIDTH                    (1U)
#define MRAMC_PC_RCBFEN(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_RCBFEN_SHIFT)) & MRAMC_PC_RCBFEN_MASK)

#define MRAMC_PC_RDBFEN_MASK                     (0x2U)
#define MRAMC_PC_RDBFEN_SHIFT                    (1U)
#define MRAMC_PC_RDBFEN_WIDTH                    (1U)
#define MRAMC_PC_RDBFEN(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_RDBFEN_SHIFT)) & MRAMC_PC_RDBFEN_MASK)

#define MRAMC_PC_RCPFEN_MASK                     (0x10U)
#define MRAMC_PC_RCPFEN_SHIFT                    (4U)
#define MRAMC_PC_RCPFEN_WIDTH                    (1U)
#define MRAMC_PC_RCPFEN(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_RCPFEN_SHIFT)) & MRAMC_PC_RCPFEN_MASK)

#define MRAMC_PC_RDPFEN_MASK                     (0x20U)
#define MRAMC_PC_RDPFEN_SHIFT                    (5U)
#define MRAMC_PC_RDPFEN_WIDTH                    (1U)
#define MRAMC_PC_RDPFEN(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_RDPFEN_SHIFT)) & MRAMC_PC_RDPFEN_MASK)

#define MRAMC_PC_IB_MASK                         (0x100U)
#define MRAMC_PC_IB_SHIFT                        (8U)
#define MRAMC_PC_IB_WIDTH                        (1U)
#define MRAMC_PC_IB(x)                           (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_IB_SHIFT)) & MRAMC_PC_IB_MASK)

#define MRAMC_PC_WRBFEN_MASK                     (0x1000U)
#define MRAMC_PC_WRBFEN_SHIFT                    (12U)
#define MRAMC_PC_WRBFEN_WIDTH                    (1U)
#define MRAMC_PC_WRBFEN(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_PC_WRBFEN_SHIFT)) & MRAMC_PC_WRBFEN_MASK)
/*! @} */

/*! @name P1_RIA_W0 - Port i Read ID Assignment Word j */
/*! @{ */

#define MRAMC_P1_RIA_W0_MASK_ID_MASK             (0xFFFFU)
#define MRAMC_P1_RIA_W0_MASK_ID_SHIFT            (0U)
#define MRAMC_P1_RIA_W0_MASK_ID_WIDTH            (16U)
#define MRAMC_P1_RIA_W0_MASK_ID(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W0_MASK_ID_SHIFT)) & MRAMC_P1_RIA_W0_MASK_ID_MASK)

#define MRAMC_P1_RIA_W0_NUM_ENTRIES_MASK         (0xF0000U)
#define MRAMC_P1_RIA_W0_NUM_ENTRIES_SHIFT        (16U)
#define MRAMC_P1_RIA_W0_NUM_ENTRIES_WIDTH        (4U)
#define MRAMC_P1_RIA_W0_NUM_ENTRIES(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W0_NUM_ENTRIES_SHIFT)) & MRAMC_P1_RIA_W0_NUM_ENTRIES_MASK)

#define MRAMC_P1_RIA_W0_ENABLE_MASK              (0x8000000U)
#define MRAMC_P1_RIA_W0_ENABLE_SHIFT             (27U)
#define MRAMC_P1_RIA_W0_ENABLE_WIDTH             (1U)
#define MRAMC_P1_RIA_W0_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W0_ENABLE_SHIFT)) & MRAMC_P1_RIA_W0_ENABLE_MASK)

#define MRAMC_P1_RIA_W0_LOCK_MASK                (0x80000000U)
#define MRAMC_P1_RIA_W0_LOCK_SHIFT               (31U)
#define MRAMC_P1_RIA_W0_LOCK_WIDTH               (1U)
#define MRAMC_P1_RIA_W0_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W0_LOCK_SHIFT)) & MRAMC_P1_RIA_W0_LOCK_MASK)
/*! @} */

/*! @name P1_RIA_W1 - Port i Read ID Assignment Word j */
/*! @{ */

#define MRAMC_P1_RIA_W1_MASK_ID_MASK             (0xFFFFU)
#define MRAMC_P1_RIA_W1_MASK_ID_SHIFT            (0U)
#define MRAMC_P1_RIA_W1_MASK_ID_WIDTH            (16U)
#define MRAMC_P1_RIA_W1_MASK_ID(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W1_MASK_ID_SHIFT)) & MRAMC_P1_RIA_W1_MASK_ID_MASK)

#define MRAMC_P1_RIA_W1_NUM_ENTRIES_MASK         (0xF0000U)
#define MRAMC_P1_RIA_W1_NUM_ENTRIES_SHIFT        (16U)
#define MRAMC_P1_RIA_W1_NUM_ENTRIES_WIDTH        (4U)
#define MRAMC_P1_RIA_W1_NUM_ENTRIES(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W1_NUM_ENTRIES_SHIFT)) & MRAMC_P1_RIA_W1_NUM_ENTRIES_MASK)

#define MRAMC_P1_RIA_W1_ENABLE_MASK              (0x8000000U)
#define MRAMC_P1_RIA_W1_ENABLE_SHIFT             (27U)
#define MRAMC_P1_RIA_W1_ENABLE_WIDTH             (1U)
#define MRAMC_P1_RIA_W1_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W1_ENABLE_SHIFT)) & MRAMC_P1_RIA_W1_ENABLE_MASK)

#define MRAMC_P1_RIA_W1_LOCK_MASK                (0x80000000U)
#define MRAMC_P1_RIA_W1_LOCK_SHIFT               (31U)
#define MRAMC_P1_RIA_W1_LOCK_WIDTH               (1U)
#define MRAMC_P1_RIA_W1_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_P1_RIA_W1_LOCK_SHIFT)) & MRAMC_P1_RIA_W1_LOCK_MASK)
/*! @} */

/*! @name P2_RIA_W0 - Port i Read ID Assignment Word j */
/*! @{ */

#define MRAMC_P2_RIA_W0_MASK_ID_MASK             (0xFFFFU)
#define MRAMC_P2_RIA_W0_MASK_ID_SHIFT            (0U)
#define MRAMC_P2_RIA_W0_MASK_ID_WIDTH            (16U)
#define MRAMC_P2_RIA_W0_MASK_ID(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W0_MASK_ID_SHIFT)) & MRAMC_P2_RIA_W0_MASK_ID_MASK)

#define MRAMC_P2_RIA_W0_NUM_ENTRIES_MASK         (0xF0000U)
#define MRAMC_P2_RIA_W0_NUM_ENTRIES_SHIFT        (16U)
#define MRAMC_P2_RIA_W0_NUM_ENTRIES_WIDTH        (4U)
#define MRAMC_P2_RIA_W0_NUM_ENTRIES(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W0_NUM_ENTRIES_SHIFT)) & MRAMC_P2_RIA_W0_NUM_ENTRIES_MASK)

#define MRAMC_P2_RIA_W0_ENABLE_MASK              (0x8000000U)
#define MRAMC_P2_RIA_W0_ENABLE_SHIFT             (27U)
#define MRAMC_P2_RIA_W0_ENABLE_WIDTH             (1U)
#define MRAMC_P2_RIA_W0_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W0_ENABLE_SHIFT)) & MRAMC_P2_RIA_W0_ENABLE_MASK)

#define MRAMC_P2_RIA_W0_LOCK_MASK                (0x80000000U)
#define MRAMC_P2_RIA_W0_LOCK_SHIFT               (31U)
#define MRAMC_P2_RIA_W0_LOCK_WIDTH               (1U)
#define MRAMC_P2_RIA_W0_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W0_LOCK_SHIFT)) & MRAMC_P2_RIA_W0_LOCK_MASK)
/*! @} */

/*! @name P2_RIA_W1 - Port i Read ID Assignment Word j */
/*! @{ */

#define MRAMC_P2_RIA_W1_MASK_ID_MASK             (0xFFFFU)
#define MRAMC_P2_RIA_W1_MASK_ID_SHIFT            (0U)
#define MRAMC_P2_RIA_W1_MASK_ID_WIDTH            (16U)
#define MRAMC_P2_RIA_W1_MASK_ID(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W1_MASK_ID_SHIFT)) & MRAMC_P2_RIA_W1_MASK_ID_MASK)

#define MRAMC_P2_RIA_W1_NUM_ENTRIES_MASK         (0xF0000U)
#define MRAMC_P2_RIA_W1_NUM_ENTRIES_SHIFT        (16U)
#define MRAMC_P2_RIA_W1_NUM_ENTRIES_WIDTH        (4U)
#define MRAMC_P2_RIA_W1_NUM_ENTRIES(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W1_NUM_ENTRIES_SHIFT)) & MRAMC_P2_RIA_W1_NUM_ENTRIES_MASK)

#define MRAMC_P2_RIA_W1_ENABLE_MASK              (0x8000000U)
#define MRAMC_P2_RIA_W1_ENABLE_SHIFT             (27U)
#define MRAMC_P2_RIA_W1_ENABLE_WIDTH             (1U)
#define MRAMC_P2_RIA_W1_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W1_ENABLE_SHIFT)) & MRAMC_P2_RIA_W1_ENABLE_MASK)

#define MRAMC_P2_RIA_W1_LOCK_MASK                (0x80000000U)
#define MRAMC_P2_RIA_W1_LOCK_SHIFT               (31U)
#define MRAMC_P2_RIA_W1_LOCK_WIDTH               (1U)
#define MRAMC_P2_RIA_W1_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_P2_RIA_W1_LOCK_SHIFT)) & MRAMC_P2_RIA_W1_LOCK_MASK)
/*! @} */

/*! @name P3_RIA_W0 - Port i Read ID Assignment Word j */
/*! @{ */

