zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
#define MRAMC_P3_RIA_W0_MASK_ID_MASK             (0xFFFFU)
#define MRAMC_P3_RIA_W0_MASK_ID_SHIFT            (0U)
#define MRAMC_P3_RIA_W0_MASK_ID_WIDTH            (16U)
#define MRAMC_P3_RIA_W0_MASK_ID(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_P3_RIA_W0_MASK_ID_SHIFT)) & MRAMC_P3_RIA_W0_MASK_ID_MASK)

#define MRAMC_P3_RIA_W0_NUM_ENTRIES_MASK         (0x70000U)
#define MRAMC_P3_RIA_W0_NUM_ENTRIES_SHIFT        (16U)
#define MRAMC_P3_RIA_W0_NUM_ENTRIES_WIDTH        (3U)
#define MRAMC_P3_RIA_W0_NUM_ENTRIES(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_P3_RIA_W0_NUM_ENTRIES_SHIFT)) & MRAMC_P3_RIA_W0_NUM_ENTRIES_MASK)

#define MRAMC_P3_RIA_W0_ENABLE_MASK              (0x8000000U)
#define MRAMC_P3_RIA_W0_ENABLE_SHIFT             (27U)
#define MRAMC_P3_RIA_W0_ENABLE_WIDTH             (1U)
#define MRAMC_P3_RIA_W0_ENABLE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_P3_RIA_W0_ENABLE_SHIFT)) & MRAMC_P3_RIA_W0_ENABLE_MASK)

#define MRAMC_P3_RIA_W0_LOCK_MASK                (0x80000000U)
#define MRAMC_P3_RIA_W0_LOCK_SHIFT               (31U)
#define MRAMC_P3_RIA_W0_LOCK_WIDTH               (1U)
#define MRAMC_P3_RIA_W0_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_P3_RIA_W0_LOCK_SHIFT)) & MRAMC_P3_RIA_W0_LOCK_MASK)
/*! @} */

/*! @name LPLOCK - Large Partition Lock */
/*! @{ */

#define MRAMC_LPLOCK_LCK0_MASK                   (0x1U)
#define MRAMC_LPLOCK_LCK0_SHIFT                  (0U)
#define MRAMC_LPLOCK_LCK0_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK0(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK0_SHIFT)) & MRAMC_LPLOCK_LCK0_MASK)

#define MRAMC_LPLOCK_LCK1_MASK                   (0x2U)
#define MRAMC_LPLOCK_LCK1_SHIFT                  (1U)
#define MRAMC_LPLOCK_LCK1_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK1(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK1_SHIFT)) & MRAMC_LPLOCK_LCK1_MASK)

#define MRAMC_LPLOCK_LCK2_MASK                   (0x4U)
#define MRAMC_LPLOCK_LCK2_SHIFT                  (2U)
#define MRAMC_LPLOCK_LCK2_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK2(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK2_SHIFT)) & MRAMC_LPLOCK_LCK2_MASK)

#define MRAMC_LPLOCK_LCK3_MASK                   (0x8U)
#define MRAMC_LPLOCK_LCK3_SHIFT                  (3U)
#define MRAMC_LPLOCK_LCK3_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK3(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK3_SHIFT)) & MRAMC_LPLOCK_LCK3_MASK)

#define MRAMC_LPLOCK_LCK4_MASK                   (0x10U)
#define MRAMC_LPLOCK_LCK4_SHIFT                  (4U)
#define MRAMC_LPLOCK_LCK4_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK4(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK4_SHIFT)) & MRAMC_LPLOCK_LCK4_MASK)

#define MRAMC_LPLOCK_LCK5_MASK                   (0x20U)
#define MRAMC_LPLOCK_LCK5_SHIFT                  (5U)
#define MRAMC_LPLOCK_LCK5_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK5(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK5_SHIFT)) & MRAMC_LPLOCK_LCK5_MASK)

#define MRAMC_LPLOCK_LCK6_MASK                   (0x40U)
#define MRAMC_LPLOCK_LCK6_SHIFT                  (6U)
#define MRAMC_LPLOCK_LCK6_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK6(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK6_SHIFT)) & MRAMC_LPLOCK_LCK6_MASK)

#define MRAMC_LPLOCK_LCK7_MASK                   (0x80U)
#define MRAMC_LPLOCK_LCK7_SHIFT                  (7U)
#define MRAMC_LPLOCK_LCK7_WIDTH                  (1U)
#define MRAMC_LPLOCK_LCK7(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCK_LCK7_SHIFT)) & MRAMC_LPLOCK_LCK7_MASK)
/*! @} */

/*! @name SPLOCK - Small Partition Lock */
/*! @{ */

#define MRAMC_SPLOCK_LCK_MASK                    (0x1U)
#define MRAMC_SPLOCK_LCK_SHIFT                   (0U)
#define MRAMC_SPLOCK_LCK_WIDTH                   (1U)
#define MRAMC_SPLOCK_LCK(x)                      (((uint32_t)(((uint32_t)(x)) << MRAMC_SPLOCK_LCK_SHIFT)) & MRAMC_SPLOCK_LCK_MASK)
/*! @} */

/*! @name LPOLOCK - Large Partition OTP Lock */
/*! @{ */

#define MRAMC_LPOLOCK_LCK_MASK                   (0x1U)
#define MRAMC_LPOLOCK_LCK_SHIFT                  (0U)
#define MRAMC_LPOLOCK_LCK_WIDTH                  (1U)
#define MRAMC_LPOLOCK_LCK(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_LPOLOCK_LCK_SHIFT)) & MRAMC_LPOLOCK_LCK_MASK)
/*! @} */

/*! @name UTLOCK - UTest Lock */
/*! @{ */

#define MRAMC_UTLOCK_LCK_MASK                    (0x1U)
#define MRAMC_UTLOCK_LCK_SHIFT                   (0U)
#define MRAMC_UTLOCK_LCK_WIDTH                   (1U)
#define MRAMC_UTLOCK_LCK(x)                      (((uint32_t)(((uint32_t)(x)) << MRAMC_UTLOCK_LCK_SHIFT)) & MRAMC_UTLOCK_LCK_MASK)
/*! @} */

/*! @name PLPLOCK - Protect Large Partition Lock */
/*! @{ */

#define MRAMC_PLPLOCK_PLCK0_MASK                 (0x3U)
#define MRAMC_PLPLOCK_PLCK0_SHIFT                (0U)
#define MRAMC_PLPLOCK_PLCK0_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK0(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK0_SHIFT)) & MRAMC_PLPLOCK_PLCK0_MASK)

#define MRAMC_PLPLOCK_PLCK1_MASK                 (0xCU)
#define MRAMC_PLPLOCK_PLCK1_SHIFT                (2U)
#define MRAMC_PLPLOCK_PLCK1_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK1(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK1_SHIFT)) & MRAMC_PLPLOCK_PLCK1_MASK)

#define MRAMC_PLPLOCK_PLCK2_MASK                 (0x30U)
#define MRAMC_PLPLOCK_PLCK2_SHIFT                (4U)
#define MRAMC_PLPLOCK_PLCK2_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK2(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK2_SHIFT)) & MRAMC_PLPLOCK_PLCK2_MASK)

#define MRAMC_PLPLOCK_PLCK3_MASK                 (0xC0U)
#define MRAMC_PLPLOCK_PLCK3_SHIFT                (6U)
#define MRAMC_PLPLOCK_PLCK3_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK3(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK3_SHIFT)) & MRAMC_PLPLOCK_PLCK3_MASK)

#define MRAMC_PLPLOCK_PLCK4_MASK                 (0x300U)
#define MRAMC_PLPLOCK_PLCK4_SHIFT                (8U)
#define MRAMC_PLPLOCK_PLCK4_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK4(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK4_SHIFT)) & MRAMC_PLPLOCK_PLCK4_MASK)

