zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
#define MRAMC_PLPLOCK_PLCK5_MASK                 (0xC00U)
#define MRAMC_PLPLOCK_PLCK5_SHIFT                (10U)
#define MRAMC_PLPLOCK_PLCK5_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK5(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK5_SHIFT)) & MRAMC_PLPLOCK_PLCK5_MASK)

#define MRAMC_PLPLOCK_PLCK6_MASK                 (0x3000U)
#define MRAMC_PLPLOCK_PLCK6_SHIFT                (12U)
#define MRAMC_PLPLOCK_PLCK6_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK6(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK6_SHIFT)) & MRAMC_PLPLOCK_PLCK6_MASK)

#define MRAMC_PLPLOCK_PLCK7_MASK                 (0xC000U)
#define MRAMC_PLPLOCK_PLCK7_SHIFT                (14U)
#define MRAMC_PLPLOCK_PLCK7_WIDTH                (2U)
#define MRAMC_PLPLOCK_PLCK7(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPLOCK_PLCK7_SHIFT)) & MRAMC_PLPLOCK_PLCK7_MASK)
/*! @} */

/*! @name PSPLOCK - Protect Small Partition Lock */
/*! @{ */

#define MRAMC_PSPLOCK_PLCK_MASK                  (0x3U)
#define MRAMC_PSPLOCK_PLCK_SHIFT                 (0U)
#define MRAMC_PSPLOCK_PLCK_WIDTH                 (2U)
#define MRAMC_PSPLOCK_PLCK(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_PSPLOCK_PLCK_SHIFT)) & MRAMC_PSPLOCK_PLCK_MASK)
/*! @} */

/*! @name PLPOLOCK - Protect Large Partition OTP Lock */
/*! @{ */

#define MRAMC_PLPOLOCK_PLCK_MASK                 (0x3U)
#define MRAMC_PLPOLOCK_PLCK_SHIFT                (0U)
#define MRAMC_PLPOLOCK_PLCK_WIDTH                (2U)
#define MRAMC_PLPOLOCK_PLCK(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_PLPOLOCK_PLCK_SHIFT)) & MRAMC_PLPOLOCK_PLCK_MASK)
/*! @} */

/*! @name PUTLOCK - Protect UTest Lock */
/*! @{ */

#define MRAMC_PUTLOCK_PLCK_MASK                  (0x3U)
#define MRAMC_PUTLOCK_PLCK_SHIFT                 (0U)
#define MRAMC_PUTLOCK_PLCK_WIDTH                 (2U)
#define MRAMC_PUTLOCK_PLCK(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_PUTLOCK_PLCK_SHIFT)) & MRAMC_PUTLOCK_PLCK_MASK)
/*! @} */

/*! @name LPLOCKOW - Large Partition Lock Owner */
/*! @{ */

#define MRAMC_LPLOCKOW_LOCKOWNER_MASK            (0x1FU)
#define MRAMC_LPLOCKOW_LOCKOWNER_SHIFT           (0U)
#define MRAMC_LPLOCKOW_LOCKOWNER_WIDTH           (5U)
#define MRAMC_LPLOCKOW_LOCKOWNER(x)              (((uint32_t)(((uint32_t)(x)) << MRAMC_LPLOCKOW_LOCKOWNER_SHIFT)) & MRAMC_LPLOCKOW_LOCKOWNER_MASK)
/*! @} */

/*! @name LOCKOW - Small partition Lock Owner..UTest Lock Owner */
/*! @{ */

#define MRAMC_LOCKOW_LOCKOWNER_MASK              (0x1FU)
#define MRAMC_LOCKOW_LOCKOWNER_SHIFT             (0U)
#define MRAMC_LOCKOW_LOCKOWNER_WIDTH             (5U)
#define MRAMC_LOCKOW_LOCKOWNER(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_LOCKOW_LOCKOWNER_SHIFT)) & MRAMC_LOCKOW_LOCKOWNER_MASK)
/*! @} */

/*! @name ERRINJCTL - Error Injection Control */
/*! @{ */

#define MRAMC_ERRINJCTL_IRE_MASK                 (0x1U)
#define MRAMC_ERRINJCTL_IRE_SHIFT                (0U)
#define MRAMC_ERRINJCTL_IRE_WIDTH                (1U)
#define MRAMC_ERRINJCTL_IRE(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_IRE_SHIFT)) & MRAMC_ERRINJCTL_IRE_MASK)

#define MRAMC_ERRINJCTL_IWE_MASK                 (0x2U)
#define MRAMC_ERRINJCTL_IWE_SHIFT                (1U)
#define MRAMC_ERRINJCTL_IWE_WIDTH                (1U)
#define MRAMC_ERRINJCTL_IWE(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_IWE_SHIFT)) & MRAMC_ERRINJCTL_IWE_MASK)

#define MRAMC_ERRINJCTL_ICPE_MASK                (0x8U)
#define MRAMC_ERRINJCTL_ICPE_SHIFT               (3U)
#define MRAMC_ERRINJCTL_ICPE_WIDTH               (1U)
#define MRAMC_ERRINJCTL_ICPE(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_ICPE_SHIFT)) & MRAMC_ERRINJCTL_ICPE_MASK)

#define MRAMC_ERRINJCTL_ICEE_MASK                (0x10U)
#define MRAMC_ERRINJCTL_ICEE_SHIFT               (4U)
#define MRAMC_ERRINJCTL_ICEE_WIDTH               (1U)
#define MRAMC_ERRINJCTL_ICEE(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_ICEE_SHIFT)) & MRAMC_ERRINJCTL_ICEE_MASK)

#define MRAMC_ERRINJCTL_IDEE_MASK                (0x20U)
#define MRAMC_ERRINJCTL_IDEE_SHIFT               (5U)
#define MRAMC_ERRINJCTL_IDEE_WIDTH               (1U)
#define MRAMC_ERRINJCTL_IDEE(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_IDEE_SHIFT)) & MRAMC_ERRINJCTL_IDEE_MASK)

#define MRAMC_ERRINJCTL_IADEE_MASK               (0x40U)
#define MRAMC_ERRINJCTL_IADEE_SHIFT              (6U)
#define MRAMC_ERRINJCTL_IADEE_WIDTH              (1U)
#define MRAMC_ERRINJCTL_IADEE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_IADEE_SHIFT)) & MRAMC_ERRINJCTL_IADEE_MASK)

#define MRAMC_ERRINJCTL_IMDEE_MASK               (0x100U)
#define MRAMC_ERRINJCTL_IMDEE_SHIFT              (8U)
#define MRAMC_ERRINJCTL_IMDEE_WIDTH              (1U)
#define MRAMC_ERRINJCTL_IMDEE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_IMDEE_SHIFT)) & MRAMC_ERRINJCTL_IMDEE_MASK)

#define MRAMC_ERRINJCTL_MOD_ID_MASK              (0x7000000U)
#define MRAMC_ERRINJCTL_MOD_ID_SHIFT             (24U)
#define MRAMC_ERRINJCTL_MOD_ID_WIDTH             (3U)
#define MRAMC_ERRINJCTL_MOD_ID(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_MOD_ID_SHIFT)) & MRAMC_ERRINJCTL_MOD_ID_MASK)

#define MRAMC_ERRINJCTL_EIE_MASK                 (0x80000000U)
#define MRAMC_ERRINJCTL_EIE_SHIFT                (31U)
#define MRAMC_ERRINJCTL_EIE_WIDTH                (1U)
#define MRAMC_ERRINJCTL_EIE(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRINJCTL_EIE_SHIFT)) & MRAMC_ERRINJCTL_EIE_MASK)
/*! @} */

/*! @name ERRSTAT0 - Error Status 0 */
/*! @{ */

#define MRAMC_ERRSTAT0_RE_MASK                   (0x1U)
#define MRAMC_ERRSTAT0_RE_SHIFT                  (0U)
#define MRAMC_ERRSTAT0_RE_WIDTH                  (1U)
#define MRAMC_ERRSTAT0_RE(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_RE_SHIFT)) & MRAMC_ERRSTAT0_RE_MASK)

#define MRAMC_ERRSTAT0_WE_MASK                   (0x2U)
#define MRAMC_ERRSTAT0_WE_SHIFT                  (1U)
#define MRAMC_ERRSTAT0_WE_WIDTH                  (1U)
#define MRAMC_ERRSTAT0_WE(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_WE_SHIFT)) & MRAMC_ERRSTAT0_WE_MASK)

