zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
#define MRAMC_ERRSTAT0_PWE_MASK                  (0x4U)
#define MRAMC_ERRSTAT0_PWE_SHIFT                 (2U)
#define MRAMC_ERRSTAT0_PWE_WIDTH                 (1U)
#define MRAMC_ERRSTAT0_PWE(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_PWE_SHIFT)) & MRAMC_ERRSTAT0_PWE_MASK)

#define MRAMC_ERRSTAT0_CPE_MASK                  (0x8U)
#define MRAMC_ERRSTAT0_CPE_SHIFT                 (3U)
#define MRAMC_ERRSTAT0_CPE_WIDTH                 (1U)
#define MRAMC_ERRSTAT0_CPE(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_CPE_SHIFT)) & MRAMC_ERRSTAT0_CPE_MASK)

#define MRAMC_ERRSTAT0_CEE_MASK                  (0x10U)
#define MRAMC_ERRSTAT0_CEE_SHIFT                 (4U)
#define MRAMC_ERRSTAT0_CEE_WIDTH                 (1U)
#define MRAMC_ERRSTAT0_CEE(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_CEE_SHIFT)) & MRAMC_ERRSTAT0_CEE_MASK)

#define MRAMC_ERRSTAT0_DEE_MASK                  (0x20U)
#define MRAMC_ERRSTAT0_DEE_SHIFT                 (5U)
#define MRAMC_ERRSTAT0_DEE_WIDTH                 (1U)
#define MRAMC_ERRSTAT0_DEE(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_DEE_SHIFT)) & MRAMC_ERRSTAT0_DEE_MASK)

#define MRAMC_ERRSTAT0_MCE_MASK                  (0x40U)
#define MRAMC_ERRSTAT0_MCE_SHIFT                 (6U)
#define MRAMC_ERRSTAT0_MCE_WIDTH                 (1U)
#define MRAMC_ERRSTAT0_MCE(x)                    (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_MCE_SHIFT)) & MRAMC_ERRSTAT0_MCE_MASK)

#define MRAMC_ERRSTAT0_ME_MASK                   (0x80U)
#define MRAMC_ERRSTAT0_ME_SHIFT                  (7U)
#define MRAMC_ERRSTAT0_ME_WIDTH                  (1U)
#define MRAMC_ERRSTAT0_ME(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_ME_SHIFT)) & MRAMC_ERRSTAT0_ME_MASK)

#define MRAMC_ERRSTAT0_MEEE_MASK                 (0x10000U)
#define MRAMC_ERRSTAT0_MEEE_SHIFT                (16U)
#define MRAMC_ERRSTAT0_MEEE_WIDTH                (1U)
#define MRAMC_ERRSTAT0_MEEE(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_MEEE_SHIFT)) & MRAMC_ERRSTAT0_MEEE_MASK)

#define MRAMC_ERRSTAT0_UE_MASK                   (0x20000U)
#define MRAMC_ERRSTAT0_UE_SHIFT                  (17U)
#define MRAMC_ERRSTAT0_UE_WIDTH                  (1U)
#define MRAMC_ERRSTAT0_UE(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT0_UE_SHIFT)) & MRAMC_ERRSTAT0_UE_MASK)
/*! @} */

/*! @name ERRSTAT1 - Error Status 1 */
/*! @{ */

#define MRAMC_ERRSTAT1_ADDR_MASK                 (0xFFFFFFFFU)
#define MRAMC_ERRSTAT1_ADDR_SHIFT                (0U)
#define MRAMC_ERRSTAT1_ADDR_WIDTH                (32U)
#define MRAMC_ERRSTAT1_ADDR(x)                   (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRSTAT1_ADDR_SHIFT)) & MRAMC_ERRSTAT1_ADDR_MASK)
/*! @} */

/*! @name ERRNTCTL0 - Error Notification Control 0 */
/*! @{ */

#define MRAMC_ERRNTCTL0_PWENE_MASK               (0x4U)
#define MRAMC_ERRNTCTL0_PWENE_SHIFT              (2U)
#define MRAMC_ERRNTCTL0_PWENE_WIDTH              (1U)
#define MRAMC_ERRNTCTL0_PWENE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_PWENE_SHIFT)) & MRAMC_ERRNTCTL0_PWENE_MASK)

#define MRAMC_ERRNTCTL0_CPENE_MASK               (0x8U)
#define MRAMC_ERRNTCTL0_CPENE_SHIFT              (3U)
#define MRAMC_ERRNTCTL0_CPENE_WIDTH              (1U)
#define MRAMC_ERRNTCTL0_CPENE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_CPENE_SHIFT)) & MRAMC_ERRNTCTL0_CPENE_MASK)

#define MRAMC_ERRNTCTL0_CEENE_MASK               (0x10U)
#define MRAMC_ERRNTCTL0_CEENE_SHIFT              (4U)
#define MRAMC_ERRNTCTL0_CEENE_WIDTH              (1U)
#define MRAMC_ERRNTCTL0_CEENE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_CEENE_SHIFT)) & MRAMC_ERRNTCTL0_CEENE_MASK)

#define MRAMC_ERRNTCTL0_DEENE_MASK               (0x20U)
#define MRAMC_ERRNTCTL0_DEENE_SHIFT              (5U)
#define MRAMC_ERRNTCTL0_DEENE_WIDTH              (1U)
#define MRAMC_ERRNTCTL0_DEENE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_DEENE_SHIFT)) & MRAMC_ERRNTCTL0_DEENE_MASK)

#define MRAMC_ERRNTCTL0_MCENE_MASK               (0x40U)
#define MRAMC_ERRNTCTL0_MCENE_SHIFT              (6U)
#define MRAMC_ERRNTCTL0_MCENE_WIDTH              (1U)
#define MRAMC_ERRNTCTL0_MCENE(x)                 (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_MCENE_SHIFT)) & MRAMC_ERRNTCTL0_MCENE_MASK)

#define MRAMC_ERRNTCTL0_MENE_MASK                (0x80U)
#define MRAMC_ERRNTCTL0_MENE_SHIFT               (7U)
#define MRAMC_ERRNTCTL0_MENE_WIDTH               (1U)
#define MRAMC_ERRNTCTL0_MENE(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_MENE_SHIFT)) & MRAMC_ERRNTCTL0_MENE_MASK)

#define MRAMC_ERRNTCTL0_Reserved_MASK            (0x100U)
#define MRAMC_ERRNTCTL0_Reserved_SHIFT           (8U)
#define MRAMC_ERRNTCTL0_Reserved_WIDTH           (1U)
#define MRAMC_ERRNTCTL0_Reserved(x)              (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_Reserved_SHIFT)) & MRAMC_ERRNTCTL0_Reserved_MASK)

#define MRAMC_ERRNTCTL0_MEEENE_MASK              (0x10000U)
#define MRAMC_ERRNTCTL0_MEEENE_SHIFT             (16U)
#define MRAMC_ERRNTCTL0_MEEENE_WIDTH             (1U)
#define MRAMC_ERRNTCTL0_MEEENE(x)                (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_MEEENE_SHIFT)) & MRAMC_ERRNTCTL0_MEEENE_MASK)

#define MRAMC_ERRNTCTL0_UENE_MASK                (0x20000U)
#define MRAMC_ERRNTCTL0_UENE_SHIFT               (17U)
#define MRAMC_ERRNTCTL0_UENE_WIDTH               (1U)
#define MRAMC_ERRNTCTL0_UENE(x)                  (((uint32_t)(((uint32_t)(x)) << MRAMC_ERRNTCTL0_UENE_SHIFT)) & MRAMC_ERRNTCTL0_UENE_MASK)
/*! @} */

/*! @name WWDOG - Write Watchdog */
/*! @{ */

#define MRAMC_WWDOG_WDD_MASK                     (0x8000000U)
#define MRAMC_WWDOG_WDD_SHIFT                    (27U)
#define MRAMC_WWDOG_WDD_WIDTH                    (1U)
#define MRAMC_WWDOG_WDD(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_WWDOG_WDD_SHIFT)) & MRAMC_WWDOG_WDD_MASK)

#define MRAMC_WWDOG_WDT_MASK                     (0x30000000U)
#define MRAMC_WWDOG_WDT_SHIFT                    (28U)
#define MRAMC_WWDOG_WDT_WIDTH                    (2U)
#define MRAMC_WWDOG_WDT(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_WWDOG_WDT_SHIFT)) & MRAMC_WWDOG_WDT_MASK)

#define MRAMC_WWDOG_WDL_MASK                     (0x80000000U)
#define MRAMC_WWDOG_WDL_SHIFT                    (31U)
#define MRAMC_WWDOG_WDL_WIDTH                    (1U)
#define MRAMC_WWDOG_WDL(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_WWDOG_WDL_SHIFT)) & MRAMC_WWDOG_WDL_MASK)
/*! @} */

