zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MRAMC.h
/*! @name WDATA_PAGE_WORD - Write Data */
/*! @{ */

#define MRAMC_WDATA_PAGE_WORD_WDATA_MASK         (0xFFFFFFFFU)
#define MRAMC_WDATA_PAGE_WORD_WDATA_SHIFT        (0U)
#define MRAMC_WDATA_PAGE_WORD_WDATA_WIDTH        (32U)
#define MRAMC_WDATA_PAGE_WORD_WDATA(x)           (((uint32_t)(((uint32_t)(x)) << MRAMC_WDATA_PAGE_WORD_WDATA_SHIFT)) & MRAMC_WDATA_PAGE_WORD_WDATA_MASK)
/*! @} */

/*! @name WSTRB_PAGE - Write Strobe */
/*! @{ */

#define MRAMC_WSTRB_PAGE_WSTRB0_MASK             (0xFU)
#define MRAMC_WSTRB_PAGE_WSTRB0_SHIFT            (0U)
#define MRAMC_WSTRB_PAGE_WSTRB0_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB0(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB0_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB0_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB1_MASK             (0xF0U)
#define MRAMC_WSTRB_PAGE_WSTRB1_SHIFT            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB1_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB1(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB1_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB1_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB2_MASK             (0xF00U)
#define MRAMC_WSTRB_PAGE_WSTRB2_SHIFT            (8U)
#define MRAMC_WSTRB_PAGE_WSTRB2_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB2(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB2_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB2_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB3_MASK             (0xF000U)
#define MRAMC_WSTRB_PAGE_WSTRB3_SHIFT            (12U)
#define MRAMC_WSTRB_PAGE_WSTRB3_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB3(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB3_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB3_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB4_MASK             (0xF0000U)
#define MRAMC_WSTRB_PAGE_WSTRB4_SHIFT            (16U)
#define MRAMC_WSTRB_PAGE_WSTRB4_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB4(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB4_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB4_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB5_MASK             (0xF00000U)
#define MRAMC_WSTRB_PAGE_WSTRB5_SHIFT            (20U)
#define MRAMC_WSTRB_PAGE_WSTRB5_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB5(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB5_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB5_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB6_MASK             (0xF000000U)
#define MRAMC_WSTRB_PAGE_WSTRB6_SHIFT            (24U)
#define MRAMC_WSTRB_PAGE_WSTRB6_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB6(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB6_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB6_MASK)

#define MRAMC_WSTRB_PAGE_WSTRB7_MASK             (0xF0000000U)
#define MRAMC_WSTRB_PAGE_WSTRB7_SHIFT            (28U)
#define MRAMC_WSTRB_PAGE_WSTRB7_WIDTH            (4U)
#define MRAMC_WSTRB_PAGE_WSTRB7(x)               (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTRB_PAGE_WSTRB7_SHIFT)) & MRAMC_WSTRB_PAGE_WSTRB7_MASK)
/*! @} */

/*! @name WADDR - Write Address */
/*! @{ */

#define MRAMC_WADDR_WADDR_MASK                   (0xFFFFFFE0U)
#define MRAMC_WADDR_WADDR_SHIFT                  (5U)
#define MRAMC_WADDR_WADDR_WIDTH                  (27U)
#define MRAMC_WADDR_WADDR(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_WADDR_WADDR_SHIFT)) & MRAMC_WADDR_WADDR_MASK)
/*! @} */

/*! @name WCTL - Write Control */
/*! @{ */

#define MRAMC_WCTL_SMW_MASK                      (0x1U)
#define MRAMC_WCTL_SMW_SHIFT                     (0U)
#define MRAMC_WCTL_SMW_WIDTH                     (1U)
#define MRAMC_WCTL_SMW(x)                        (((uint32_t)(((uint32_t)(x)) << MRAMC_WCTL_SMW_SHIFT)) & MRAMC_WCTL_SMW_MASK)

#define MRAMC_WCTL_CWSL_MASK                     (0x2U)
#define MRAMC_WCTL_CWSL_SHIFT                    (1U)
#define MRAMC_WCTL_CWSL_WIDTH                    (1U)
#define MRAMC_WCTL_CWSL(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_WCTL_CWSL_SHIFT)) & MRAMC_WCTL_CWSL_MASK)

#define MRAMC_WCTL_NUM_WP_MASK                   (0xF0000U)
#define MRAMC_WCTL_NUM_WP_SHIFT                  (16U)
#define MRAMC_WCTL_NUM_WP_WIDTH                  (4U)
#define MRAMC_WCTL_NUM_WP(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_WCTL_NUM_WP_SHIFT)) & MRAMC_WCTL_NUM_WP_MASK)

#define MRAMC_WCTL_WDCLR_MASK                    (0x1000000U)
#define MRAMC_WCTL_WDCLR_SHIFT                   (24U)
#define MRAMC_WCTL_WDCLR_WIDTH                   (1U)
#define MRAMC_WCTL_WDCLR(x)                      (((uint32_t)(((uint32_t)(x)) << MRAMC_WCTL_WDCLR_SHIFT)) & MRAMC_WCTL_WDCLR_MASK)
/*! @} */

/*! @name WSTAT - Write Status */
/*! @{ */

#define MRAMC_WSTAT_WBUSY_MASK                   (0x1U)
#define MRAMC_WSTAT_WBUSY_SHIFT                  (0U)
#define MRAMC_WSTAT_WBUSY_WIDTH                  (1U)
#define MRAMC_WSTAT_WBUSY(x)                     (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTAT_WBUSY_SHIFT)) & MRAMC_WSTAT_WBUSY_MASK)

#define MRAMC_WSTAT_WERR_MASK                    (0x2U)
#define MRAMC_WSTAT_WERR_SHIFT                   (1U)
#define MRAMC_WSTAT_WERR_WIDTH                   (1U)
#define MRAMC_WSTAT_WERR(x)                      (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTAT_WERR_SHIFT)) & MRAMC_WSTAT_WERR_MASK)

#define MRAMC_WSTAT_WDTE_MASK                    (0x4U)
#define MRAMC_WSTAT_WDTE_SHIFT                   (2U)
#define MRAMC_WSTAT_WDTE_WIDTH                   (1U)
#define MRAMC_WSTAT_WDTE(x)                      (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTAT_WDTE_SHIFT)) & MRAMC_WSTAT_WDTE_MASK)

#define MRAMC_WSTAT_WID_MASK                     (0x1F0000U)
#define MRAMC_WSTAT_WID_SHIFT                    (16U)
#define MRAMC_WSTAT_WID_WIDTH                    (5U)
#define MRAMC_WSTAT_WID(x)                       (((uint32_t)(((uint32_t)(x)) << MRAMC_WSTAT_WID_SHIFT)) & MRAMC_WSTAT_WID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MRAMC_Register_Masks */

/*!
 * @}
 */ /* end of group MRAMC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MRAMC_H_) */
